function getSum(input) {
    let index = 1; //Определяне стойност на индекса в масива 
    
    //създаваме променлива за числото, което ще взимаме от масива
    let num = Number(input[index]);
    index++;
    
    //създаваме променлива за контролното число
    let controlNum = Number(input[0]);
    //създаваме променлива за сборът от въведените числа
    let inputSum = 0;

    //създаваме цикъл за проверка на сумата от въведените числа и контролното число
    while (inputSum < controlNum) {
       
        //в цикъла правим сбор на числото от масива + текущата сума
        inputSum += num; 
       
        //увеличаваме индекса на променливата съдържаща въведенето число.
        num = Number(input[index]);
        index++;
       
    }

    //след проверката печатаме резултата на достигната сума
    console.log (inputSum);

}
getSum(["100",
"10",
"20",
"30",
"40"]);